text_check_membership = 'Выберите группу, которую хотите настроить:'
text_not_group = '''Ботелло не добавлен ни в одну вашу группу. Пожалуйста добавьте @spam_botello_bot в свою группу и
и обновите список групп'''
text_choice_group = 'Выберите действие:'
text_members_management = 'Выберите действие:'
text_admins_management = 'Выберите действие:'
text_setting_group = 'Выберите действие:'

# TEXTS BAN USER FROM PRIVATE

text_ban_user_from_private = 'Введите username пользователя, которого вы хотите забанить или нажмите "Отмена"'
text_ban_user_not_found = 'Пользователь не найден. Попробуйте еще раз или нажмите "Отмена"'
text_user_banned_from_private = 'Пользователь заблокирован'
text_admin_try_ban_admin = '''Этот пользователь является администратором группы. Администраторов имеет право банить 
только владелец группы. Попробуйте еще раз или нажмите "Отмена"'''
text_banned_user_already_kicked = 'Этот пользователь уже забанен. Попробуйте еще раз или нажмите "Отмена"'
text_banned_user_left = 'Этот пользователь вышел из группы. Попробуйте еще раз или нажмите "Отмена"'
text_banned_user_is_creator = 'Вы не можете забанить владельца группы. Попробуйте еще раз или нажмите "Отмена"'


# TEXTS UNBAN USER FROM PRIVATE

text_unban_user_true = '''
Чтобы разбанить участника нажмите на его юзернейм (текст после слова USERNAME). Он скопируется.\n
После этого отправьте его боту\n\n
<b>ЗАБАНЕННЫЕ УЧАСТНИКИ:</b>\n
'''
text_unban_user_false = '''
В группе сейчас нет забаненных участников
'''
text_user_unbanned_from_private = 'Пользователь разблокирован'
text_unban_user_not_found = 'Пользователь не найден. Попробуйте еще раз или нажмите "Отмена"'
text_incorrect_username_for_unban = 'Некорректный юзернейм пользователя. Попробуйте еще раз или нажмите "Отмена"'


# TEXTS MUTE USER FROM PRIVATE
text_mute_user_from_private = 'Введите username пользователя, которого вы хотите замьютить или нажмите "Отмена"'
text_choice_term_mute_user = '''
Выберите продолжительность, на которую вы хотите замьютить пользователя или нажмите "Отмена"
'''
text_admin_try_mute_admin = '''Этот пользователь является администратором группы. Администраторов имеет право мьютить 
только владелец группы. Попробуйте еще раз или нажмите "Отмена"'''
text_muted_user_is_creator = 'Вы не можете замьютить владельца группы. Попробуйте еще раз или нажмите "Отмена"'


